Tekla Open API Reference for Tekla Structures 2025
AnalysisCrossSection Methods
The AnalysisCrossSection type exposes the following members.
Methods
Name | Description
Delete
 Deletes an analysis cross section. The AnalysisModelName and ID have to be set.
GetCrossSectionGroup
 Gets the cross section group.
Insert
 Inserts an analysis cross section. The AnalysisModelName has to be set.
Select
 Selects an analysis cross section. The AnalysisModelName and ID/Name have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisCrossSection Class
Tekla.Structures.Analysis Namespace